import { Component } from "react";
import formula from '../formula.PNG';
class Method extends Component{

    render (){

        return( <div className="settings">
            <h1 >Метод трапеций</h1>
            <p>Метод трапеций — метод численного интегрирования функции одной переменной, заключающийся в замене на каждом элементарном отрезке подынтегральной функции на многочлен первой степени, то есть линейную функцию. Площадь под графиком функции аппроксимируется прямоугольными трапециями. Алгебраический порядок точности равен 1.
            Если отрезок [a,b] разбивается узлами интегрирования и на каждом из элементарных отрезков применяется формула трапеций, то суммирование даст составную формулу трапеций
            </p>
                <img className="formula" src={formula}/>
            <p>
            Это простое применение формулы для площади трапеции — произведение полусуммы оснований каждого разбиения, которыми в данном случае являются значения функции в крайних точках отрезка, на высоту (длину отрезка интегрирования). Погрешность аппроксимации можно оценить через максимум второй производной
            </p>
        </div>
        );
    }
}
export default Method;